; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=80, out_folder=htg/blocksworld/training, instance_id=60, seed=2084, goal_proportion=0.1

(define (problem blocksworld-60)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on-table b1)
    (clear b45)
    (on b45 b53)
    (on-table b53)
    (clear b29)
    (on b29 b39)
    (on-table b39)
    (clear b34)
    (on b34 b3)
    (on-table b3)
    (clear b74)
    (on b74 b37)
    (on b37 b64)
    (on b64 b9)
    (on b9 b27)
    (on b27 b70)
    (on b70 b55)
    (on-table b55)
    (clear b47)
    (on b47 b10)
    (on b10 b4)
    (on b4 b2)
    (on-table b2)
    (clear b60)
    (on b60 b26)
    (on b26 b79)
    (on b79 b62)
    (on-table b62)
    (clear b41)
    (on-table b41)
    (clear b50)
    (on b50 b7)
    (on b7 b54)
    (on b54 b12)
    (on-table b12)
    (clear b22)
    (on b22 b71)
    (on b71 b58)
    (on b58 b8)
    (on b8 b46)
    (on b46 b11)
    (on-table b11)
    (clear b65)
    (on b65 b49)
    (on b49 b15)
    (on-table b15)
    (clear b30)
    (on b30 b5)
    (on b5 b32)
    (on b32 b40)
    (on b40 b33)
    (on b33 b13)
    (on b13 b17)
    (on b17 b69)
    (on b69 b25)
    (on b25 b16)
    (on b16 b44)
    (on b44 b52)
    (on b52 b68)
    (on-table b68)
    (clear b19)
    (on b19 b76)
    (on-table b76)
    (clear b23)
    (on b23 b72)
    (on b72 b31)
    (on-table b31)
    (clear b18)
    (on b18 b66)
    (on b66 b57)
    (on b57 b80)
    (on b80 b59)
    (on b59 b73)
    (on b73 b35)
    (on b35 b38)
    (on b38 b43)
    (on b43 b21)
    (on b21 b48)
    (on b48 b20)
    (on b20 b67)
    (on b67 b63)
    (on b63 b24)
    (on b24 b14)
    (on-table b14)
    (clear b6)
    (on-table b6)
    (clear b75)
    (on b75 b61)
    (on-table b61)
    (clear b28)
    (on-table b28)
    (clear b51)
    (on-table b51)
    (clear b77)
    (on b77 b42)
    (on b42 b78)
    (on b78 b36)
    (on b36 b56)
    (on-table b56))
 (:goal  (and 
    (clear b7)
    (on b7 b6)
    (on-table b6)
    (clear b1)
    (on-table b1)
    (clear b2)
    (on b2 b4)
    (on b4 b3)
    (on b3 b5)
    (on-table b5)
    (clear b8)
    (on-table b8))))

; plan
1. (unstack b50 b7)
   deleted: (on b50 b7) (clear b50) (arm-empty)
   added: (holding b50) (clear b7)
   goals met: 4 of 12
2. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 4 of 12
3. (unstack b7 b54)
   deleted: (on b7 b54) (clear b7) (arm-empty)
   added: (holding b7) (clear b54)
   goals met: 3 of 12
4. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 5 of 12
5. (unstack b30 b5)
   deleted: (on b30 b5) (clear b30) (arm-empty)
   added: (holding b30) (clear b5)
   goals met: 5 of 12
6. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 5 of 12
7. (unstack b5 b32)
   deleted: (on b5 b32) (clear b5) (arm-empty)
   added: (holding b5) (clear b32)
   goals met: 5 of 12
8. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 6 of 12
9. (unstack b34 b3)
   deleted: (on b34 b3) (clear b34) (arm-empty)
   added: (holding b34) (clear b3)
   goals met: 6 of 12
10. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 6 of 12
11. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 6 of 12
12. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 7 of 12
13. (unstack b22 b71)
   deleted: (on b22 b71) (clear b22) (arm-empty)
   added: (holding b22) (clear b71)
   goals met: 7 of 12
14. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 7 of 12
15. (unstack b71 b58)
   deleted: (on b71 b58) (clear b71) (arm-empty)
   added: (holding b71) (clear b58)
   goals met: 7 of 12
16. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 7 of 12
17. (unstack b58 b8)
   deleted: (on b58 b8) (clear b58) (arm-empty)
   added: (holding b58) (clear b8)
   goals met: 8 of 12
18. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 8 of 12
19. (unstack b8 b46)
   deleted: (on b8 b46) (clear b8) (arm-empty)
   added: (holding b8) (clear b46)
   goals met: 7 of 12
20. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 9 of 12
21. (unstack b47 b10)
   deleted: (on b47 b10) (clear b47) (arm-empty)
   added: (holding b47) (clear b10)
   goals met: 9 of 12
22. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 9 of 12
23. (unstack b10 b4)
   deleted: (on b10 b4) (clear b10) (arm-empty)
   added: (holding b10) (clear b4)
   goals met: 9 of 12
24. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 9 of 12
25. (unstack b4 b2)
   deleted: (on b4 b2) (clear b4) (arm-empty)
   added: (holding b4) (clear b2)
   goals met: 10 of 12
26. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 11 of 12
27. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 10 of 12
28. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 12 of 12
